Revit 2026 API

# ImageExportOptionsExportRange Property

---

The export range defining which view(s) will be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportRange ExportRange { get; set; }
```
```vb
Public Property ExportRange As ExportRange
	Get
	Set
```
```cpp
public:
property ExportRange ExportRange {
	ExportRange get ();
	void set (ExportRange value);
}
```
```fsharp
member ExportRange : ExportRange with get, set
```

#### Property Value

ExportRange

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Note that SetOfViews is not an acceptable value if these options are used to save an image to a project as a new view.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace